---
title: BendFailures
classe: Autodesk.Revit.DB.BuiltInFailures+BendFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 16
---

# BendFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId BendAngleIsUnacceptable { get; }` | `BendFailures.BendAngleIsUnacceptable` | FailureDefinitionId |
| `FailureDefinitionId DeleteMiddleBendNotAllowed { get; }` | `BendFailures.DeleteMiddleBendNotAllowed` | FailureDefinitionId |
| `FailureDefinitionId DeleteSegmentInBankNotAllowed { get; }` | `BendFailures.DeleteSegmentInBankNotAllowed` | FailureDefinitionId |
| `FailureDefinitionId NotBentControl { get; }` | `BendFailures.NotBentControl` | FailureDefinitionId |
| `FailureDefinitionId NotBentDetailComponent { get; }` | `BendFailures.NotBentDetailComponent` | FailureDefinitionId |
| `FailureDefinitionId NotBentFilledRegion { get; }` | `BendFailures.NotBentFilledRegion` | FailureDefinitionId |
| `FailureDefinitionId NotBentImage { get; }` | `BendFailures.NotBentImage` | FailureDefinitionId |
| `FailureDefinitionId NotBentImport { get; }` | `BendFailures.NotBentImport` | FailureDefinitionId |
| `FailureDefinitionId NotBentMaskingRegion { get; }` | `BendFailures.NotBentMaskingRegion` | FailureDefinitionId |
| `FailureDefinitionId NotBentModelLine { get; }` | `BendFailures.NotBentModelLine` | FailureDefinitionId |
| `FailureDefinitionId NotBentOpening { get; }` | `BendFailures.NotBentOpening` | FailureDefinitionId |
| `FailureDefinitionId NotBentRefLine { get; }` | `BendFailures.NotBentRefLine` | FailureDefinitionId |
| `FailureDefinitionId NotBentRefPlane { get; }` | `BendFailures.NotBentRefPlane` | FailureDefinitionId |
| `FailureDefinitionId NotBentSharedFamily { get; }` | `BendFailures.NotBentSharedFamily` | FailureDefinitionId |
| `FailureDefinitionId NotBentSymbol { get; }` | `BendFailures.NotBentSymbol` | FailureDefinitionId |
| `FailureDefinitionId NotBentSymbolicLine { get; }` | `BendFailures.NotBentSymbolicLine` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```